# https://github.com/Homebrew/homebrew-bundle
# In order to speed the initial bootstrap process, this Brewfile only installs
# essentials. A more complete Brewfile is symlinked to the home directory when
# the dotfiles are installed. After the initial bootstrap is complete, run
# `brew bundle install --global`

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'

# Homebrew
# https://github.com/Homebrew/brew/
brew 'bash-completion'
brew 'dockutil'
brew 'git'
brew 'htop'
brew 'mas'
brew 'python'
brew 'tmux'
brew 'wget'
brew 'nmap'
brew 'p7zip'
brew 'smartmontools'
brew 'syncthing', restart_service: true
brew 'xctool'

brew 'zsh'
brew 'z'
brew 'fish'
brew 'rbenv'

brew 'chisel'
brew 'lame'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'youtube-dl'


# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask 'chromium'
cask 'opera'
cask 'tunnelblick'
cask 'harvest'
cask 'boxer'
cask 'textmate'
cask 'fork'
cask 'oclint'
cask 'virtualbox'
cask 'apptrap'
cask 'spectacle'
cask 'smcfancontrol'
cask 'discord'
cask 'slack'
cask 'libreoffice'
cask 'steam'

# mas-cli
# https://github.com/argon/mas
mas 'Xcode', id: 497799835
