# https://github.com/Homebrew/homebrew-bundle
# In order to speed the initial bootstrap process, this Brewfile only installs
# essentials. A more complete Brewfile is symlinked to the home directory when
# the dotfiles are installed. After the initial bootstrap is complete, run
# `brew bundle install --global`

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'
tap 'homebrew/cask-drivers'

# Homebrew
# https://github.com/Homebrew/brew/
brew 'bash-completion'
brew 'git'
brew 'htop'
brew 'mas'
brew 'syncthing', restart_service: true
brew 'xctool'
brew 'ruby'
brew 'gh'
brew 'xcodegen'

brew 'fish'

brew 'chisel'
brew 'yt-dlp'

brew 'platformio'
brew 'colima'
brew 'lazygit'
brew 'docker-buildx'
brew 'docker-compose'
brew 'neovim'
brew 'swiftformat'
brew 'swiftlint'
brew 'xcode-build-server'
brew 'xcodes'
brew 'tree-sitter'
brew 'starship'
brew 'fd'


# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask 'fork'
cask 'amethyst'
cask 'slack'
cask 'bitwarden'
cask 'stats'
cask 'monitorcontrol'
cask 'visual-studio-code'
cask 'kitty'
cask 'font-meslo-lg-nerd-font'
cask 'font-hack-nerd-font'


# mas-cli
# https://github.com/argon/mas
mas 'Amphetamine', id: 937984704
